In [1]:
import numpy as np
import pandas as pd
from src.gstar import GSTAR

In [2]:
z = pd.DataFrame(
    np.array([
        [67.44, 74.71, 68.02, 67.24],
        [67.54, 75.01, 68.41, 67.51],
        [67.16, 74.71, 68.4 , 67.56],
        [66.97, 74.56, 68.35, 67.66],
        [67.64, 74.97, 68.72, 67.93],
        [68.07, 75.34, 69.  , 68.05],
        [68.27, 75.36, 69.3 , 68.32],
        [68.38, 75.42, 69.65, 68.75],
        [69.57, 75.61, 70.02, 69.05],
        [70.14, 76.13, 70.46, 70.64]
    ]),
    columns = ['Purwokerto', 'Surakarta', 'Semarang', 'Tegal'],
    index = ['2006-01-31', '2006-02-28', '2006-03-31', '2006-04-30', '2006-05-31',
             '2006-06-30', '2006-07-31', '2006-08-31', '2006-09-30', '2006-10-31']
)

w1 = np.array([
    [0, 1/3, 1/3, 1/3],
    [1/3, 0, 1/3, 1/3],
    [1/3, 1/3, 0, 1/3],
    [1/3, 1/3, 1/3, 0],
])

p = 1
w = [w1]
lambd = [1]

In [3]:
gstar = GSTAR(z, w, p, lambd)

In [4]:
gstar.fit()

In [5]:
z

            Purwokerto  Surakarta  Semarang  Tegal
2006-01-31       67.44      74.71     68.02  67.24
2006-02-28       67.54      75.01     68.41  67.51
2006-03-31       67.16      74.71     68.40  67.56
2006-04-30       66.97      74.56     68.35  67.66
2006-05-31       67.64      74.97     68.72  67.93
2006-06-30       68.07      75.34     69.00  68.05
2006-07-31       68.27      75.36     69.30  68.32
2006-08-31       68.38      75.42     69.65  68.75
2006-09-30       69.57      75.61     70.02  69.05
2006-10-31       70.14      76.13     70.46  70.64

In [6]:
gstar.fitted

            Purwokerto  Surakarta   Semarang      Tegal
2006-02-28   67.746391  74.725254  68.220008  67.635920
2006-03-31   67.839225  75.018224  68.646298  67.906026
2006-04-30   67.446654  74.780462  68.675960  67.933028
2006-05-31   67.250016  74.665524  68.631515  68.014280
2006-06-30   67.935231  75.101583  68.988626  68.302551
2006-07-31   68.373866  75.448804  69.265603  68.442659
2006-08-31   68.575159  75.562890  69.595200  68.705333
2006-09-30   68.679814  75.718493  69.977853  69.115185
2006-10-31   69.908643  76.085263  70.313106  69.439308

In [7]:
gstar.predict(10)

   Purwokerto  Surakarta   Semarang      Tegal
0   70.472124  76.761682  70.666600  70.943997
1   70.804485  77.278984  70.831957  71.255846
2   71.138829  77.718318  70.954582  71.570639
3   71.476621  78.102504  71.030473  71.884874
4   71.819206  78.445437  71.053425  72.195886
5   72.167927  78.755067  71.015116  72.501472
6   72.524209  79.035306  70.905034  72.799635
7   72.889639  79.287213  70.710272  73.088392
8   73.266033  79.509723  70.415205  73.365640
9   73.655498  79.700056  70.001072  73.629031